app/controllers/courses_controller.rb

  def index
    @user=session[:user]
    @courses = Course.all
---
SELECT * FROM "courses"

  def show
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1)

  def edit
    @course = Course.find(params[:id])
---
SELECT * FROM "courses" WHERE ("courses"."id" = 1)

  def create
    @course = Course.new(params[:course])

    respond_to do |format|
      if @course.save
---
INSERT INTO "courses" ("name", "created_at", "updated_at", "description") VALUES(E'test 2', '2009-11-09 00:20:11.058462', '2009-11-09 00:20:11.058462', E'desc 2') RETURNING "id"